#!/bin/bash
#########################################################################
# File Name   : qc.sh
# Author      : CaiJinJu
# Mail        : 517402802@qq.com 
# Created Time: 2017/12/18 19:59:34
#########################################################################
# Version Log :
#               2017-12-19 初版 V01 完成
#			   - Q-Code 脚本主框架，提供选择跳转处理。
#			   - 选项可数字，可字母（数字不好记）
#
#########################################################################

function prompt() {
	echo "**************************************************"
	echo "*                 Q-Code 处理脚本                *"
	echo "**************************************************"
	echo "* 请选择：                                       *"
	echo "*    0：输入变量名生成模版                       *"
	echo "*    1：生成组合语音表格数据                     *"
	echo "*    2：暂无                                     *"
	echo "*                                                *"
	echo "*    q：退出脚本                                 *"
	echo "**************************************************"
}

#########################################################################
clear

flag=1
while((flag))
do
	prompt
	read -p "请输入您的选择：" choose
	case ${choose} in
		0|r|R)
			r.sh
			;;
		1|v|V)
			b.sh
			;;
		2)
			;;
		q|Q)
			flag=0
			echo "感谢使用！再见！~~~~"
			;;
	esac
done
